<?php

return [
    'daemon_connection_failed' => 'При попытке связи с узлом произошла ошибка HTTP/:code. Информация была передана администрации. (идентификатор запроса: :request_id)',
    'node' => [
        'servers_attached' => 'Узел не должен иметь подключенных к нему серверов, чтобы быть удален.',
        'error_connecting' => 'Ошибка подключения к :node',
        'daemon_off_config_updated' => 'Конфигурация Daemon\'а <strong>была обновлена</strong>, но при попытке автоматического обновления конфигурационного файла произошла ошибка. Вам нужно вручную обновить конфигурационный файл (config.yml) для применения этих изменений.',
    ],
    'allocations' => [
        'server_using' => 'Сервер в настоящее время назначается для этого размещения. Распределение может быть удалено, только если ни один сервер не назначен.',
        'too_many_ports' => 'Добавление более 1000 портов в одном диапазоне за раз не поддерживается.',
        'invalid_mapping' => 'Сопоставление, предоставленное для порта {port}, было недопустимым и не могло быть обработано.',
        'cidr_out_of_range' => 'Нотация CIDR допускает только маски между /25 и /32.',
        'port_out_of_range' => 'Порты в распределении должны находиться в диапазоне от 1024 до 65535 включительно.',
    ],
    'egg' => [
        'delete_has_servers' => 'Egg с подключенными к нему серверами не может быть удален из Panel\'и.',
        'invalid_copy_id' => 'Egg, выбранный для копирования сценария, либо не существует, либо копирует сценарий из самого себя.',
        'has_children' => 'Этот Egg является родительским для одного или нескольких других Egg\'ов. Пожалуйста, удалите эти Egg\'ы, прежде чем удалять этот Egg.',
    ],
    'variables' => [
        'env_not_unique' => 'Переменная окружения :name должна быть уникальной для этого Egg\'а.',
        'reserved_name' => 'Переменная окружения :name защищена и не может быть назначена переменной.',
        'bad_validation_rule' => 'Правило проверки ":rule" не является правилом для этого приложения.',
    ],
    'importer' => [
        'json_error' => 'Произошла ошибка при попытке разобрать файл JSON: :error.',
        'file_error' => 'Указанный JSON файл недействителен.',
        'invalid_json_provided' => 'Предоставленный файл JSON не имеет формата, который можно распознать.',
    ],
    'subusers' => [
        'editing_self' => 'Редактирование вашей учетной записи подпользователя запрещено.',
        'user_is_owner' => 'Вы не можете добавить владельца сервера в качестве субпользователя для этого сервера.',
        'subuser_exists' => 'Пользователь с таким адресом электронной почты уже назначен в качестве субпользователя для этого сервера.',
    ],
    'databases' => [
        'delete_has_databases' => 'Невозможно удалить сервер хоста базы данных, на котором есть активные базы данных.',
    ],
    'tasks' => [
        'chain_interval_too_long' => 'Максимальное время интервала для связанной задачи составляет 15 минут.',
    ],
    'locations' => [
        'has_nodes' => 'Невозможно удалить местоположение, в котором к нему прикреплены активные узлы.',
    ],
    'users' => [
        'is_self' => 'Вы не можете удалить свой аккаунт.',
        'has_servers' => 'Нельзя удалить пользователя, пока у него есть активные серверы. Сначала удалите серверы, чтобы продолжить.',
        'node_revocation_failed' => 'Не удалось отозвать ключи на <a href=":link">узле #:node</a>. :error',
    ],
    'deployment' => [
        'no_viable_nodes' => 'No nodes satisfying the requirements specified for automatic deployment could be found.',
        'no_viable_allocations' => 'Не найдено ни одного распределения, удовлетворяющего требованиям для автоматического развертывания на этом узле.',
    ],
    'api' => [
        'resource_not_found' => 'Запрашиваемый ресурс не существует на сервере.',
    ],
    'mount' => [
        'servers_attached' => 'Точку монтирования можно удалить только без подключённых серверов.',
    ],
    'server' => [
        'marked_as_failed' => 'Этот сервер ещё не завершил процесс установки, пожалуйста, попробуйте позже.',
        'file_too_large' => 'Файл, который вы пытаетесь открыть, слишком велик для просмотра в файловом редакторе.',
        'state_conflict' => 'В данный момент этот сервер не поддерживается, пожалуйста, попробуйте позже.',
        'suspended' => 'Узел этого сервера в настоящее время приостановлен, и запрошенная функциональность недоступна.',
        'maintenance' => 'Узел этого сервера в настоящее время находится на технических работах, и запрошенная функциональность недоступна.',
        'restoring_backup' => 'Этот сервер в настоящее время восстанавливается из резервной копии, пожалуйста, повторите попытку позже.',
        'transferring' => 'Этот сервер в настоящее время передается на новую машину, пожалуйста, повторите попытку позже.',
    ],
];
