<?php

return [
    'heading' => 'Добро пожаловать в :app!',
    'version' => 'Версия: :version',
    'advanced' => 'Дополнительно',
    'server' => 'Сервер',
    'user' => 'Пользователь',
    'sections' => [
        'intro-developers' => [
            'heading' => 'Информация для разработчиков',
            'content' => 'Спасибо за тестирование версии для разработки!',
            'extra_note' => 'Если вы столкнётесь с какими-либо проблемами, пожалуйста, сообщите о них на GitHub.',
            'button_issues' => 'Сообщить о проблеме',
            'button_features' => 'Обсудить функционал',
        ],
        'intro-update-available' => [
            'heading' => 'Доступно обновление',
            'content' => ':latestVersion теперь доступна! Прочтите нашу документацию, чтобы обновить вашу панель.',
            'button_changelog' => 'Что нового?',
        ],
        'intro-no-update' => [
            'heading' => 'Версия вашей панели актуальна',
            'content' => 'Сейчас вы используете версию :version. Свежих обновлений нет!',
        ],
        'intro-first-node' => [
            'heading' => 'Узлы не обнаружены',
            'content' => 'Похоже, что вы ещё не добавили ни одного узла. Нажмите кнопку, чтобы добавить новый узел!',
            'extra_note' => 'Если вы столкнулись с какими-либо проблемами, пожалуйста, сообщите о них на GitHub.',
            'button_label' => 'Создайте первый узел',
        ],
        'intro-support' => [
            'heading' => 'Поддержка Pelican',
            'content' => 'Благодарим вас за использование Pelican, всё это возможно только благодаря вашей поддержке, наших участников и всех остальных!',
            'extra_note' => 'Мы ценим любую поддержку со стороны каждого.',
            'button_translate' => 'Помочь с переводом',
            'button_donate' => 'Пожертвовать напрямую',
        ],
        'intro-help' => [
            'heading' => 'Нужна помощь?',
            'content' => 'Перед тем, как спрашивать помощи на нашем сервере Discord, прочитайте документацию!',
            'button_docs' => 'Документация',
        ],
    ],
];
